// цикли for, while, do while
// цикл буде відбуватися 10 раз, за кожну ітерацію цикла, значення буде збільшуватися на одиницю, і так буде відбуватися до тих пір, поки i не досягне 10
// for(var i = 0; i < 10; i++) {
//     console.log(i);
// } 

// for (var i = 100; i > 5; i /= 2) {
//     console.log(i);
// }

// var j = 1000;
// while(j >= 500) {
//     console.log(j);
//     j -= 100;
// }

// var isHasCar = true;
// while(isHasCar) {

// }

// do while відрізняється тим, що спочатку робить один цикл, потім провіряє умову, а while зразу провіряє умову, тільки потім робить цикл


var i = 100;
do {
    console.log(i);
    i += 60;
} while (i < 105);

